Tekla.Structures.Model.LoadGroup.LoadGroupType
The possible types for load groups.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_DEFAULT_GROUP
The Eurocode default group type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_SELF_WEIGHT
The Eurocode self weight type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_PERMANENT_LOAD
The Eurocode permanent load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_PRE_STRESS_LOAD
The Eurocode pre-stress load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_LIVE_LOAD_HOUSING
The Eurocode live load housing type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_LIVE_LOAD_PUBLIC_BUILDINGS
The Eurocode live load public buildings type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_LIVE_LOAD_THEATRES_RESTAURANTS
The Eurocode live load theatres, restaurants type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_LIVE_LOAD_WAREHOUSES
The Eurocode live load warehouses type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_LIVE_LOAD_STORAGE_BUILDINGS
The Eurocode live load storage buildings type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_TRAFFIC_LOAD_LIGHT_VEHICLES
The Eurocode traffic load light vehicles type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_TRAFFIC_LOAD_HEAVY_VEHICLES
The Eurocode traffic load heavy vehicles type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_TRAFFIC_LOAD_ROOFS
The Eurocode traffic load roofs type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_SNOW_LOAD
The Eurocode snow load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_WIND_LOAD
The Eurocode wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_FORCES_DUE_TO_TEMPERATURE_EFFECTS
The Eurocode forces due to temperature effects type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_IMPERFECTION_LOAD_DUE_TO_DEAD_LOADS
The Eurocode imperfection load due to dead loads type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_IMPERFECTION_LOAD_DUE_TO_LIVE_LOADS
The Eurocode imperfection load due to live loads type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_IMPERFECTION_LOAD_DUE_TO_SNOW_LOADS
The Eurocode imperfection load due to snow loads type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_ACCIDENTAL_LOAD
The Eurocode accidental load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.EUROCODE_EARTHQUAKE_LOAD
The Eurocode earthquake load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BRITISH_CODE_DEAD_LOAD_ALONE
The British code dead load alone type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BRITISH_CODE_DEADLOAD
The British code dead load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BRITISH_CODE_IMPOSED_LOAD
The British code imposed load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BRITISH_CODE_WIND_LOAD
The British code wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BRITISH_CODE_TEMPERATURE_LOAD
The British code temperature load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BRITISH_CODE_VERTICAL_CRANE_LOAD
The British code vertical crane load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BRITISH_CODE_HORIZONTAL_CRANE_LOAD
The British code horizontal crane load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_DEAD_LOAD_ALONE
The AISC dead load alone type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_DEAD_LOAD
The AISC dead load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_LIVE_LOAD
The AISC live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_ROOF_LIVE_LOAD
The AISC roof live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_WIND_LOAD
The AISC wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_SNOW_LOAD
The AISC snow load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_RAINWATER_LOAD
The AISC rainwater load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.AISC_EARTHQUAKE_LOAD
The AISC earthquake load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.CM66_PERMANENT_LOAD_FR
The CM66 permanent load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.CM66_EXPLOITATION_LOAD_FR
The CM66 exploitation load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.CM66_TEMPERATURE_LOAD_FR
The CM66 temperature load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.CM66_WIND_LOAD_FR
The CM66 wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.CM66_SNOW_LOAD_FR
The CM66 snow load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.CM66_SEISMIC_LOAD_HORIZONTAL_FR
The CM66 seismic load horizontal type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.CM66_SEISMIC_LOAD_VERTICAL_FR
The CM66 seismic load vertical type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BAEL91_PERMANENT_LOAD_FR
The BAEL91 permanent load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BAEL91_EXPLOITATION_LOAD_FR
The BAEL91 exploitation load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BAEL91_TEMPERATURE_LOAD_FR
The BAEL91 temperature load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BAEL91_WIND_LOAD_FR
The BAEL91 wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BAEL91_SNOW_LOAD_FR
The BAEL91 snow load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BAEL91_SEISMIC_LOAD_FR
The BAEL91 seismic load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.BAEL91_ACCIDENTAL_LOAD_FR
The BAEL91 accidental load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_DEAD_LOAD
The UBC dead load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_LIVE_LOAD
The UBC live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_ROOF_LIVE_LOAD
The UBC roof live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_WIND_LOAD
The UBC wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_SNOW_LOAD
The UBC snow load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_TEMPERATURE_LOAD
The UBC temperature load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_FLUIDS_LOAD
The UBC fluids load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_SOIL_LOAD
The UBC soil load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_PONDING_LOAD
The UBC ponding load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.UBC_SEISMIC_LOAD
The UBC seismic load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_DEAD_LOAD
The IBC dead load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_LIVE_LOAD
The IBC live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_ROOF_LIVE_LOAD
The IBC roof live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_WIND_LOAD
The IBC wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_SNOW_LOAD
The IBC snow load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_TEMPERATURE_LOAD
The IBC temperature load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_FLUIDS_LOAD
The IBC fluids load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_SOIL_LOAD
The IBC soil load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_RAIN_LOAD
The IBC rain load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_PONDING_LOAD
The IBC ponding load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.IBC_SEISMIC_LOAD
The IBC seismic load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_DEAD_LOAD
The ACI dead load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_LIVE_LOAD
The ACI live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_ROOF_LIVE_LOAD
The ACI roof live load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_WIND_LOAD
The ACI wind load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_SEISMIC_LOAD
The ACI seismic load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_SNOW_LOAD
The ACI snow load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_FLUIDS_LOAD
The ACI fluids load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_SOIL_LOAD
The ACI soil load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_RAIN_LOAD
The ACI rain load type.

Tekla.Structures.Model.LoadGroup.LoadGroupType.ACI_TEMPERATURE_LOAD
The ACI temperature load type.